import pandas as pd
df = pd.read_csv('GooglePlayStore_wild.csv')
# Виведи інформацію про всі DataFrame, щоб дізнатися, які стовпці потребують очищення
print(df.info())
# Скільки в датасеті додатків, у яких не вказано (NaN) рейтинг (Rating)?

# Заміни порожнє значення ('NaN') рейтингу ('Rating') для таких програм на -1.

# Визнач, яке ще значення розміру ('Size') зберігається в датасеті крім Кілобайтів та Мегабайтів, заміни його на -1.

# Перетвори розміри додатків ('Size') у числовий формат (float). Розмір усіх програм повинен вимірюватися в Мегабайтах.

# Чому дорівнює максимальний розмір ('Size') додатків з категорії ('Category') 'TOOLS'?

# Заміни тип даних на дробове число (float) для цін додатків (Price)


# Обчисли, скільки доларів розробники заробили на кожному платному додатку

# Чому дорівнює максимальний дохід ('Profit') серед платних додатків (Type == 'Paid')?

# Створи новий стовпець, у якому зберігатиметься кількість жанрів. Назви його 'Number of genres'

# Яка максимальна кількість жанрів (Number of genres) зберігається в датасеті?
